Revit 2027 API
PropertyTableEntry.IsValidPropertyTableEntry Method
 Function used to check the input data is valid to create PropertyTableEntry object
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidPropertyTableEntry(
	double distance,
	double bearing,
	PropertyTableEntryCurveType curveType,
	double arcRadius,
	PropertyTableEntryArcDirection arcDir
)
Public Shared Function IsValidPropertyTableEntry (
	distance As Double,
	bearing As Double,
	curveType As PropertyTableEntryCurveType,
	arcRadius As Double,
	arcDir As PropertyTableEntryArcDirection
) As Boolean
public:
static bool IsValidPropertyTableEntry(
	double distance,
	double bearing,
	PropertyTableEntryCurveType curveType,
	double arcRadius,
	PropertyTableEntryArcDirection arcDir
)
static member IsValidPropertyTableEntry :
        distance : float *
        bearing : float *
        curveType : PropertyTableEntryCurveType *
        arcRadius : float *
        arcDir : PropertyTableEntryArcDirection -> bool
Parameters
distance Double
 The distance(start point to end point) of the PropertyTableEntry. The unit is feet.
bearing Double
 The angle of the PropertyTableEntry. The value should be in [0-2*PI]
curveType PropertyTableEntryCurveType
 PropertyTableEntry type.
arcRadius Double
 If the curveType is Arc, this input the radius of the arc; It is not used if type is Line.
arcDir PropertyTableEntryArcDirection
 If the curveType is Arc, indicate the curve direction, either left or right. It is not used if type is Line.
Return Value
Boolean
 True if it is valid to create PropertyTableEntry; otherwise it is not valid.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PropertyTableEntry Class
Autodesk.Revit.DB Namespace